namespace Puya.Text
{
    public class NumberFa: Number
    {
        public NumberFa(int n): base(n, "fa")
        {
            zero = "صفر";
            and = " و ";
            and2 = " و ";
            and3 = " و ";
            ones = new string[] { "", "يک", "دو", "سه", "چهار", "پنج", "شش", "هفت", "هشت", "نه" };
            teens = new string[] { "ده", "يازده", "دوازده", "سيزده", "چهارده", "پانزده", "شانزده", "هفده", "هجده", "نوزده" };
            tens = new string[] { "بيست", "سي", "چهل", "پنجاه", "شصت", "هفتاد", "هشتاد", "نود" };
            hundreds = new string[] { "صد", "دويست", "سيصد", "چهارصد", "پانصد", "ششصد", "هفتصد", "هشتصد", "نهصد" };
            units = new string[] { "", "هزار", "ميليون", "ميليارد", "تريليون", "کوادريليون", "کوينتيليون", "سکستيليون", "سپتيليون", "اکتيليون", "نانيليون" };
        }
    }
}
